# GetSpecTypeId Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
Definition..::..GetSpecTypeId Method
Definition Class See Also
---
Gets the identifier of the spec describing values of the parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2021
# Syntax
C#
---
```text
[ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the GetDataType() method instead.")]
public ForgeTypeId GetSpecTypeId()
```

Visual Basic
---
```text
<ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the GetDataType() method instead.")> _
Public Function GetSpecTypeId As ForgeTypeId
```

Visual C++
---
```text
[ObsoleteAttribute(L"This method is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the GetDataType() method instead.")]
public:
ForgeTypeId^ GetSpecTypeId()
```

# See Also
Definition Class
Autodesk.Revit.DB Namespace